{
  "about": "ABOUT ME",
  "metext1": "Born in 1976 in Argentina, Victor Alaluf was interested in the Arts from an early age. Victor moved to Israel at the age of 19. He received his Bachelor of Fine Arts and Master of Fine Arts from the University of Haifa in Israel. Today Victor lives and works in Berlin. His art is mainly Installation-Art, which combines drawings, sculpting, video art and other mediums.",
  "metext2": "Victor’s work can be described as biographic but not in the technical sense of a diary-book or an archive. The artist’s personal past experiences serve as a source of background associations from which he draws inspiration and which serve as a starting point for further reflection. In this sense Victor’s years-long confrontation with illness and his experiences of leaving his home town and moving from place to place, are reflected in his work.",
  "metext3": "One aspect of Victor’s work expresses a personal process of confronting various aspects of life, perhaps death, which we tend to avoid. However, instead of avoidance and suppression, the installations present us with an alternative based on an uninhibited acceptance of those elements that are normally considered repulsive. We are presented with a combination of converse elements, internally interwoven, but all revolving around the confrontation between illness, pain, degeneration and death on the one hand and serenity, gentleness and aesthetics on the other hand. Moreover, it prompts us to reexamine our dichotomized understanding of the pleasant-repulsive and life-death polarities that together as a whole constitute our humanness.",
  "metext4": "Recurring themes of Victor’s work have to do with issues of fragility and structure. Interestingly, precisely those elements that give structure and stability to the human body are themselves very sensitive and fragile. These works also raise the question whether some of the social issues we encounter in life are mirrored by the delicate construction of our own organic bodies.",
  "metext5": "Another aspect of Victor’s work has to do with collecting discarded objects and attempting to give them a new life. This reflects Victor’s focus on issues of past and future and the relation of these notions to the question of identity. Are we determined by our given past or by the decisions we make in the present and which shape our future?  How should we understand our commitment to the past on the one hand and to the future on the other hand?",
  "metext6": "Other works refer to the notion of “home”. Especially in recent years, huge masses of people are required to leave their home countries and look for a new beginning in a totally new environment. Questions such as “what makes a home?”, as well as the relation between the experiences we carry with us and those we encounter in our new environment, are recurrent themes in Victor’s works.",
  "metext7": "Other projects express an attempt to bring to awareness and call for reflection on our current social structure and moral values, which constitute the connecting threads of humanity."
}
